Revit 2027 API
TextElement.GetMaximumAllowedWidth Method
 Returns the maximum width the text element can be assigned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetMaximumAllowedWidth()
Public Function GetMaximumAllowedWidth As Double
public:
double GetMaximumAllowedWidth()
member GetMaximumAllowedWidth : unit -> float
Return Value
Double
 The maximum allowed width in paper space [ft].
Remarks
 Note that it is not necessarily a constant; it can be affected by properties of the text and its type, such as the width factor.
See Also
Reference
TextElement Class
GetMaximumAllowedWidth Overload
Autodesk.Revit.DB Namespace